tap "common-fate/granted"
tap "daytonaio/cli"
tap "geldata/tap"

# gel build deps
brew "autoconf"
brew "icu4c@76"
brew "icu4c@77"
brew "libtool"
brew "protobuf"
brew "protobuf-c"
brew "readline"
brew "rustup"
brew "zlib"

# terminal
brew "fd"
brew "fzf"
brew "tmux"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# pythons
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "uv"

# javascripts
brew "node"

# neovim
brew "luarocks"
brew "neovim"
brew "ripgrep"

# devtools
brew "gh"
brew "git"
brew "common-fate/granted/granted"
brew "daytonaio/cli/daytona"

brew "cmake"
brew "ffmpeg"
brew "gnutls"
brew "rust"
brew "utf8proc"

